#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

random_pet.table_name: Refreshing state... [id=whole-moose]
aws_dynamodb_table.tfc_example_table: Refreshing state... [id=sublime-dev-whole-moose]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_dynamodb_table.tfc_example_table must be replaced
-/+ resource "aws_dynamodb_table" "tfc_example_table" {
      ~ arn              = "arn:aws:dynamodb:eu-west-1:920543715711:table/sublime-dev-whole-moose" -> (known after apply)
        billing_mode     = "PROVISIONED"
        hash_key         = "UUID"
      ~ id               = "sublime-dev-whole-moose" -> (known after apply)
      ~ name             = "sublime-dev-whole-moose" -> "sskz-dev-whole-moose" # forces replacement
        read_capacity    = 1
      + stream_arn       = (known after apply)
      - stream_enabled   = false -> null
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      - tags             = {} -> null
        write_capacity   = 1

        attribute {
            name = "UUID"
            type = "S"
        }

      ~ point_in_time_recovery {
          ~ enabled = false -> (known after apply)
        }

      + server_side_encryption {
          + enabled = (known after apply)
        }

      - ttl {
          - enabled = false -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @SublimeYohan, Action: `pull_request`*